import 'package:flutter/material.dart';

List<String> question = [
  '너는 취미가 뭐야?',
  '원하는 직업 있어?',
  '약속 없는 주말에 보통 뭐해?',
  '가장 좋아하는 야외 활동이 뭐야?',
  '이상형이 어떻게 돼?',
  '좌우명이 뭐야?',
  '자연이나 도시 중에 어디서 살고싶어? 이유도 같이 말해줘!',
  '소원을 한 가지 빌 수 있다면 무슨 소원을 빌 거야?',
  '내 성격을 한 마디로 표현한다면?',
  '남이보는 내 모습은 어때?',
  '넌 너가 예쁘고, 잘생기고 완벽하다고 생각해?',
  '우울할 때 어떻게 극복해?'
];

List<String> question_IE = [
  '너는 글이나 말로 전달하는 것 중에서 어떤걸 더 선호하는 편이야?',
  '너는 말 잘 들어주는 사람과 말 잘 하는 사람 중에 어떤 쪽에 가까워?',
  '친구/연인이랑 일주일에 보통 몇 번 만나?',
  '답장 평균 시간 알려줘'
];

List<String> question_SN = [
  '노래들을때 멜로디랑 가사. 어떤 것에 더 초점을 두는 편이야?',
  '"아무생각도 하지 마"라는 것에 대해서 어떻게 생각해?'
];

List<String> question_TF = [
  '친구가 “나 우울해서 머리했어..”라고하면 너는 뭐라고 대답할거야?',
  '너의 성취에 대해서 친구가 “너 정말 잘했다. 너 되게 열심히 안 하던데.. 너 재능있나보네!”라고한다면 어떨 것 같아?'
];

List<String> question_PJ = [
  '재밌는 곳이나 맛있는 곳 찾으면 저장해뒀다가 나중에 가려고 하는 편이야?',
  '만약 동생이 너의 옷을 빌려입고 원래있던 제자리에 두지 않고 돌려줬어. 그때 너는 어떤 기분일 것 같아?'
];